app/controllers/v1/api_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "user1@email.com"], ["LIMIT", 1]]
---
  def auth
    # Alternative to users_get call that returns the User token in addition to
    # the rest of the model, provided proper authentication is given.

    unless request.headers['Content-Type'] == 'application/x-www-form-urlencoded'
      error_array = ['must be application/x-www-form-urlencoded']
      if request.headers['Content-Type'].present?
        error_array.push('cannot be ' + request.headers['Content-Type'])
      else
        error_array.push('cannot be nil')
      end
      errors = { content_type: error_array }
      raise BadRequest.new(errors)
    end
    if params[:user].blank?
      errors = { email: ['cannot be blank'], password: ['cannot be blank'] }
      raise BadRequest.new(errors)
    end
    if params[:user][:email].blank?

INSERT INTO "auth_events" ("ip_address", "success", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["ip_address", "127.0.0.1/32"], ["success", false], ["user_id", "7fff4b12-83c2-50b2-845f-52ae10a9aeee"], ["created_at", 2016-12-29 20:57:15 UTC], ["updated_at", 2016-12-29 20:57:15 UTC]]
---
    user = user.try(:authenticate, params[:user][:password])
    unless user
      auth_event.success = false
      auth_event.save!

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "doesnt@exist.com"], ["LIMIT", 1]]
UPDATE "users" SET "reset_password_sent_at" = $1, "reset_password_token" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["reset_password_sent_at", 2016-12-29 19:04:56 UTC], ["reset_password_token", "xQND9c"], ["updated_at", 2016-12-29 19:04:56 UTC], ["id", "7fff4b12-83c2-50b2-845f-52ae10a9aeee"]]
---
  def reset_password
    unless params[:user] && params[:user][:email]
      errors = { email: 'is required' }
      raise BadRequest.new(errors)
    end

    user = User.find_by(email: params[:user][:email])
    return head :not_found unless user

    token = user.generate_password_reset
    user.save!

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "user1@email.com"], ["LIMIT", 1]]
SELECT  1 AS one FROM "users" WHERE "users"."email" = $1 AND ("users"."id" != $2) LIMIT $3  [["email", "user1@email.com"], ["id", "7fff4b12-83c2-50b2-845f-52ae10a9aeee"], ["LIMIT", 1]]
---
  def update_password
    errors = {}
    if params[:user].blank?
      errors = {
        email: 'is required',
        password: 'is required'
      }
      raise BadRequest.new(errors)
    else
      errors[:email] = 'is required' if params[:user][:email].blank?

UPDATE "users" SET "password_digest" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["password_digest", "$2a$04$9rBum9M94HZijRUdyLMtWuS7BVOWlJNHppHv1DUq9gd77d44fhYnq"], ["updated_at", 2016-12-29 21:03:39 UTC], ["id", "7fff4b12-83c2-50b2-845f-52ae10a9aeee"]]
---
      return render json: errors, status: :bad_request
    end

    unless user.update(password: params[:user][:password])

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "does@not.exist"], ["LIMIT", 1]]
---
  def check_email
    user = User.find_by(email: params[:email])