app/controllers/v1/users_controller.rb

  def create
    # Create new User
    user = User.new(user_params)
    # Generate the User's auth token
    user.generate_token
    # Save and check for validation errors
    raise UnprocessableEntity.new(user.errors) unless user.save
---
INSERT INTO "users" ("fname", "lname", "token", "email", "password_digest", "dob", "phone", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update_me
    unless @authed_user.update(user_update_params)
---
UPDATE "users" SET "fname" = $1, "lname" = $2, "password_digest" = $3, "phone" = $4, "updated_at" = $5 WHERE "users"."id" = $6